# Exercise 1

In [6]:
import os
from sqlalchemy import create_engine
import pandas as pd
pd.set_option('display.max_columns', 20)

In [7]:
def query_pandas(sql, db):
    """
    Executes a SQL query on a PostgreSQL database and returns the result as a Pandas DataFrame.

    Args:
        sql (str): The SQL query to execute.
        db (str): The name of the PostgreSQL database to connect to.

    Returns:
        pandas.DataFrame: The result of the SQL query as a Pandas DataFrame.
    """

    DATABASE_URL='postgresql://postgres:postgres@postgis_container:5432/{}'.format(db)
    conn = create_engine(DATABASE_URL)

    df = pd.read_sql(sql=sql, con=conn)

    return df

### Q1: 埼玉県で一番小さい面積の市町村を調べる

In [28]:
# " "のなかにSQL文を記述
sql = " select name_2, st_area(geom::geography) from adm2 where name_1='Saitama' order by st_area(geom::geography) limit 1;"

In [29]:
out = query_pandas(sql, 'gisdb') #specify db name
print(out)

   name_2       st_area
0  Warabi  6.587194e+06

### Q2. 都道府県ごとに一番大きい面積を有する市町村を調べる

In [59]:
# " "のなかにSQL文を記述
sql = " select a.name_1, a.name_2, st_area(geom::geography) as st_area from adm2 as a inner join (select name_1, max(st_area(geom::geography)) as max from adm2 group by name_1) as b on a.name_1 = b.name_1 and st_area(geom::geography) = b.max; "

In [60]:
out = query_pandas(sql, 'gisdb') #specify db name
print(out)

       name_1         name_2       st_area
0       Aichi         Toyota  9.149657e+08
1       Akita      Yurihonjō  1.236171e+09
2      Aomori          Mutsu  8.621801e+08
3       Chiba       Ichihara  3.728970e+08
4       Ehime      Kumakōgen  5.824939e+08
5       Fukui            Ōno  8.785213e+08
6     Fukuoka     Kitakyūshū  4.845351e+08
7   Fukushima          Iwaki  1.212133e+09
8        Gifu       Takayama  2.173869e+09
9       Gunma       Minakami  7.744545e+08
10  Hiroshima        Shōbara  1.233377e+09
11   Hokkaido         Ashoro  1.406101e+09
12      Hyōgo        Toyooka  6.948764e+08
13    Ibaraki     Hitachiōta  3.730510e+08
14   Ishikawa        Hakusan  7.611476e+08
15      Iwate     Ichinoseki  1.139296e+09
16     Kagawa      Takamatsu  3.864838e+08
17  Kagoshima  Satsumasendai  7.128770e+08
18   Kanagawa       Yokohama  4.230858e+08
19      Kochi       Shimanto  6.356620e+08
20   Kumamoto        Amakusa  8.045475e+08
21      Kyoto          Kyoto  8.423308e+08
22        Mie            Tsu  6.875023e+08
23     Miyagi       Kurihara  7.971190e+08
24   Miyazaki        Nobeoka  8.569520e+08
25     Nagano      Matsumoto  9.431379e+08
26   Naoasaki       Tsushima  7.330600e+08
27       Nara      Totsukawa  6.666787e+08
28    Niigata       Murakami  1.183740e+09
29       Oita          Saiki  9.087197e+08
30    Okayama         Maniwa  8.373478e+08
31    Okinawa       Taketomi  3.390339e+08
32      Osaka          Osaka  2.223389e+08
33       Saga        Karatsu  4.933445e+08
34    Saitama       Chichibu  5.806138e+08
35      Shiga      Lake Biwa  6.858578e+08
36    Shimane         Masuda  7.480778e+08
37   Shizuoka      Hamamatsu  1.502644e+09
38    Tochigi          Nikkō  1.444965e+09
39  Tokushima        Miyoshi  7.223176e+08
40      Tokyo        Okutama  2.256680e+08
41    Tottori        Tottori  7.687152e+08
42     Toyama         Toyama  1.255340e+09
43   Wakayama      Kyōtanabe  1.049130e+09
44   Yamagata       Tsuruoka  1.343268e+09
45  Yamaguchi        Iwakuni  8.670257e+08
46  Yamanashi         Hokuto  6.034200e+08

### Q3. 都道府県ごとに市町村の総数が多い順に並べる

In [71]:
# " "のなかにSQL文を記述
sql = " select name_1, count(name_2) as city_num from adm2 group by name_1 order by city_num desc; "

In [72]:
out = query_pandas(sql, 'gisdb') #specify db name
print(out)

       name_1  city_num
0    Hokkaido       180
1      Nagano        82
2     Saitama        70
3     Fukuoka        66
4       Aichi        64
5   Fukushima        60
6       Chiba        56
7       Tokyo        53
8    Kumamoto        48
9   Kagoshima        46
10    Ibaraki        45
11      Osaka        43
12       Gifu        43
13   Shizuoka        43
14    Okinawa        42
15      Hyōgo        41
16     Aomori        40
17       Nara        39
18      Gunma        38
19     Miyagi        36
20      Kochi        35
21   Yamagata        35
22      Iwate        35
23   Kanagawa        33
24    Niigata        31
25    Tochigi        31
26    Okayama        30
27   Miyazaki        30
28   Wakayama        29
29  Yamanashi        28
30        Mie        28
31      Shiga        27
32      Kyoto        26
33      Akita        25
34  Tokushima        24
35   Naoasaki        23
36  Hiroshima        23
37    Shimane        22
38       Saga        20
39      Ehime        20
40  Yamaguchi        20
41   Ishikawa        19
42       Oita        18
43    Tottori        18
44      Fukui        17
45     Toyama        15
46     Kagawa        14

### Q4. 都道府県ごとに村の総数が多い順に並べる

In [163]:
# " "のなかにSQL文を記述
#sql = "select name_1, coalesce(count(name_2), 0)as aaa from adm2 where type_2 = 'Mura' group by name_1 order by aaa desc;"
sql = "select t1.name_1, coalesce(count(t2.name_2), 0) as city_num from (select distinct name_1 FROM adm2) as t1 left join adm2 t2 on t1.name_1 = t2.name_1 and t2.type_2 = 'Mura' group by t1.name_1 order by city_num desc;"
# (select distinct name_1 from adm2)

In [164]:
out = query_pandas(sql, 'gisdb') #specify db name
print(out)

       name_1  city_num
0      Nagano        34
1     Okinawa        16
2    Hokkaido        15
3   Fukushima        13
4        Nara        11
5    Kumamoto         8
6      Aomori         7
7   Yamanashi         6
8       Iwate         6
9       Kochi         4
10    Fukuoka         4
11      Gunma         4
12    Niigata         3
13      Akita         3
14  Kagoshima         2
15        Mie         2
16      Aichi         2
17   Miyazaki         2
18    Ibaraki         2
19    Okayama         2
20       Gifu         2
21       Oita         1
22    Tottori         1
23  Tokushima         1
24    Shimane         1
25      Kyoto         1
26      Osaka         1
27     Toyama         1
28     Miyagi         0
29      Chiba         0
30      Ehime         0
31      Fukui         0
32  Hiroshima         0
33      Hyōgo         0
34   Ishikawa         0
35     Kagawa         0
36   Kanagawa         0
37   Naoasaki         0
38       Saga         0
39    Saitama         0
40      Shiga         0
41   Shizuoka         0
42    Tochigi         0
43      Tokyo         0
44   Wakayama         0
45   Yamagata         0
46  Yamaguchi         0